In [1]:
import pandas as pd

In [ ]:
""" Financial data was obtained from company yearly reports."""

In [2]:
df = pd.read_csv("FINANCE.csv")

In [3]:
# check the first five rows

In [4]:
df.head()

,COMPANY,YEAR,NET PROFIT,Net Income,Total Assets,Tot Liabilities,Cash Flow
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,MICROSOFT,2025.0,281724.0,101832.0,619103.0,275524.0,136162.0
2,MICROSOFT,2024.0,245122.0,88136.0,512163.0,243686.0,118548.0
3,MICROSOFT,2023.0,211915.0,72361.0,411976.0,205753.0,87582.0
4,MICROSOFT,2022.0,198270.0,72738.0,364840.0,198298.0,89035.0

In [ ]:
"""Data was cleaned"""

In [5]:
# look for null values

In [6]:
df.isnull().sum()

COMPANY            1
YEAR               1
NET PROFIT         3
Net Income         3
Total Assets       3
Tot Liabilities    3
Cash Flow          3
dtype: int64

In [7]:
# drop nulls

In [8]:
df.dropna()

,COMPANY,YEAR,NET PROFIT,Net Income,Total Assets,Tot Liabilities,Cash Flow
1,MICROSOFT,2025.0,281724.0,101832.0,619103.0,275524.0,136162.0
2,MICROSOFT,2024.0,245122.0,88136.0,512163.0,243686.0,118548.0
3,MICROSOFT,2023.0,211915.0,72361.0,411976.0,205753.0,87582.0
4,MICROSOFT,2022.0,198270.0,72738.0,364840.0,198298.0,89035.0
6,APPLE,2024.0,391035.0,93736.0,364980.0,308030.0,118254.0
7,APPLE,2023.0,383285.0,96995.0,352583.0,290437.0,110543.0
8,APPLE,2022.0,394328.0,99803.0,352755.0,302083.0,122151.0
10,TESLA,2024.0,97690.0,7091.0,122070.0,48390.0,14923.0
11,TESLA,2023.0,96773.0,14997.0,106618.0,43009.0,13256.0
12,TESLA,2022.0,81462.0,12556.0,82338.0,36440.0,14724.0

In [9]:
df.head()

,COMPANY,YEAR,NET PROFIT,Net Income,Total Assets,Tot Liabilities,Cash Flow
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,MICROSOFT,2025.0,281724.0,101832.0,619103.0,275524.0,136162.0
2,MICROSOFT,2024.0,245122.0,88136.0,512163.0,243686.0,118548.0
3,MICROSOFT,2023.0,211915.0,72361.0,411976.0,205753.0,87582.0
4,MICROSOFT,2022.0,198270.0,72738.0,364840.0,198298.0,89035.0

In [10]:
df.dropna()

,COMPANY,YEAR,NET PROFIT,Net Income,Total Assets,Tot Liabilities,Cash Flow
1,MICROSOFT,2025.0,281724.0,101832.0,619103.0,275524.0,136162.0
2,MICROSOFT,2024.0,245122.0,88136.0,512163.0,243686.0,118548.0
3,MICROSOFT,2023.0,211915.0,72361.0,411976.0,205753.0,87582.0
4,MICROSOFT,2022.0,198270.0,72738.0,364840.0,198298.0,89035.0
6,APPLE,2024.0,391035.0,93736.0,364980.0,308030.0,118254.0
7,APPLE,2023.0,383285.0,96995.0,352583.0,290437.0,110543.0
8,APPLE,2022.0,394328.0,99803.0,352755.0,302083.0,122151.0
10,TESLA,2024.0,97690.0,7091.0,122070.0,48390.0,14923.0
11,TESLA,2023.0,96773.0,14997.0,106618.0,43009.0,13256.0
12,TESLA,2022.0,81462.0,12556.0,82338.0,36440.0,14724.0

In [11]:
df.head(2)

,COMPANY,YEAR,NET PROFIT,Net Income,Total Assets,Tot Liabilities,Cash Flow
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,MICROSOFT,2025.0,281724.0,101832.0,619103.0,275524.0,136162.0

In [12]:
df.drop(0, inplace = True)

In [13]:
df.head(2)

,COMPANY,YEAR,NET PROFIT,Net Income,Total Assets,Tot Liabilities,Cash Flow
1,MICROSOFT,2025.0,281724.0,101832.0,619103.0,275524.0,136162.0
2,MICROSOFT,2024.0,245122.0,88136.0,512163.0,243686.0,118548.0

In [14]:
# change the year to integer

In [15]:
df["YEAR"]=df["YEAR"].astype(int)

In [16]:
# rename the columns using the same format.  total revenue has been wrongly put as
# net profit.  change it

In [17]:
df.rename(columns={"NET PROFIT ": "TOT_REV_MIL", "Net Income": "NET_INC_MIL","Total Assets":"TOT_ASS_MIL","Tot Liabilities": "TOT_LIAL_MIL","Cash Flow":"CASH_FLOW_MIL"}, inplace = True)

In [18]:
# check column names

In [19]:
df.columns

Index(['COMPANY', 'YEAR', 'TOT_REV_MIL', 'NET_INC_MIL', 'TOT_ASS_MIL',
       'TOT_LIAL_MIL', 'CASH_FLOW_MIL'],
      dtype='object')

In [20]:
df.dropna(inplace = True)

In [21]:
#find percentage revenue growth for each company

In [22]:
df['REV_GROWTH%']=df.groupby(['COMPANY'])['TOT_REV_MIL'].pct_change()*100

In [23]:
df.head()

,COMPANY,YEAR,TOT_REV_MIL,NET_INC_MIL,TOT_ASS_MIL,TOT_LIAL_MIL,CASH_FLOW_MIL,REV_GROWTH%
1,MICROSOFT,2025,281724.0,101832.0,619103.0,275524.0,136162.0,NaN
2,MICROSOFT,2024,245122.0,88136.0,512163.0,243686.0,118548.0,-12.992148
3,MICROSOFT,2023,211915.0,72361.0,411976.0,205753.0,87582.0,-13.547132
4,MICROSOFT,2022,198270.0,72738.0,364840.0,198298.0,89035.0,-6.438902
6,APPLE,2024,391035.0,93736.0,364980.0,308030.0,118254.0,NaN

In [24]:
# find income growth percentage for each company

In [25]:
df['INC_GROWTH%']=df.groupby(['COMPANY'])['NET_INC_MIL'].pct_change()*100

In [26]:
df.head()

,COMPANY,YEAR,TOT_REV_MIL,NET_INC_MIL,TOT_ASS_MIL,TOT_LIAL_MIL,CASH_FLOW_MIL,REV_GROWTH%,INC_GROWTH%
1,MICROSOFT,2025,281724.0,101832.0,619103.0,275524.0,136162.0,NaN,NaN
2,MICROSOFT,2024,245122.0,88136.0,512163.0,243686.0,118548.0,-12.992148,-13.449603
3,MICROSOFT,2023,211915.0,72361.0,411976.0,205753.0,87582.0,-13.547132,-17.898475
4,MICROSOFT,2022,198270.0,72738.0,364840.0,198298.0,89035.0,-6.438902,0.520999
6,APPLE,2024,391035.0,93736.0,364980.0,308030.0,118254.0,NaN,NaN

In [27]:
df.fillna(0,inplace = True)

In [28]:
df.head(2)

,COMPANY,YEAR,TOT_REV_MIL,NET_INC_MIL,TOT_ASS_MIL,TOT_LIAL_MIL,CASH_FLOW_MIL,REV_GROWTH%,INC_GROWTH%
1,MICROSOFT,2025,281724.0,101832.0,619103.0,275524.0,136162.0,0.000000,0.000000
2,MICROSOFT,2024,245122.0,88136.0,512163.0,243686.0,118548.0,-12.992148,-13.449603

In [29]:
# examine trend for growth and revenue for each company

In [30]:
df.groupby("COMPANY")["TOT_REV_MIL"].mean().sort_values(ascending=False)

COMPANY
APPLE        389549.333333
MICROSOFT    234257.750000
TESLA         91975.000000
Name: TOT_REV_MIL, dtype: float64

In [31]:
df.groupby("COMPANY")["TOT_REV_MIL"].max().sort_values(ascending=False)

COMPANY
APPLE        394328.0
MICROSOFT    281724.0
TESLA         97690.0
Name: TOT_REV_MIL, dtype: float64

In [32]:
df.groupby("COMPANY")["REV_GROWTH%"].mean().sort_values(ascending=False)

COMPANY
APPLE        0.299742
TESLA       -5.586748
MICROSOFT   -8.244546
Name: REV_GROWTH%, dtype: float64

In [33]:
df.groupby("COMPANY")["REV_GROWTH%"].max().sort_values(ascending=False)

COMPANY
APPLE        2.881146
MICROSOFT    0.000000
TESLA        0.000000
Name: REV_GROWTH%, dtype: float64

In [34]:
df.groupby("COMPANY")["REV_GROWTH%"].min().sort_values(ascending=False)

COMPANY
APPLE        -1.981920
MICROSOFT   -13.547132
TESLA       -15.821562
Name: REV_GROWTH%, dtype: float64

In [35]:
df.groupby("COMPANY")["INC_GROWTH%"].mean().sort_values(ascending=False)

COMPANY
TESLA        31.738951
APPLE         2.123927
MICROSOFT    -7.706770
Name: INC_GROWTH%, dtype: float64

In [36]:
df.groupby("COMPANY")["INC_GROWTH%"].max().sort_values(ascending=False)

COMPANY
TESLA        111.493442
APPLE          3.476786
MICROSOFT      0.520999
Name: INC_GROWTH%, dtype: float64

In [37]:
df.groupby("COMPANY")["INC_GROWTH%"].min().sort_values(ascending=False)

COMPANY
APPLE         0.000000
TESLA       -16.276589
MICROSOFT   -17.898475
Name: INC_GROWTH%, dtype: float64

In [38]:
df.to_csv("data.csv")

In [39]:
"""
From the analysis above, it is evident that over the past three years, Apple had been the largest company wrt revenue and it
has also been growing steadily.  Microsoft is the second largest.  It's revenue and growth fluctuated, gowing down and going up.
Tesla is the smallest of the three, and it's revenue has also been going down steadily.
"""

"\nFrom the analysis above, it is evident that over the past three years, Apple had been the largest company wrt revenue and it\nhas also been growing steadily.  Microsoft is the second largest.  It's revenue and growth fluctuated, gowing down and going up.\nTesla is the smallest of the three, and it's revenue has also been going down steadily.\n"

In [40]:
"""
In part two, we add a chatbot to answer financial questions making use of the data and the extracted stats
"""

'\nIn part two, we add a chatbot\n'

In [41]:
data = df.groupby("COMPANY")["TOT_REV_MIL"].mean().sort_values(ascending=False)
data.loc["APPLE"]

389549.3333333333

In [42]:
df[(df["COMPANY"]=="APPLE") & (df["YEAR"]==2022)]["TOT_REV_MIL"]

8    394328.0
Name: TOT_REV_MIL, dtype: float64

In [43]:
#  first make lists with company names and years so data can be fetched

In [77]:
company = {"APPLE","TESLA","MICROSOFT"}

In [45]:
year ={"2022","2023","2024","2025"}

In [46]:
def fetch_answers(user_query):
    for comp in company:
        if comp in str(user_query).upper():
            find_data(comp,user_query)
            break
        
    general_queries(user_query)

In [57]:
def find_data(comp, user_query):
    for yr in year:
        if yr in str(user_query):
            comp_yrly(comp, yr, user_query)
            break
        
    comp_mean(comp, user_query)

In [68]:
def comp_mean(comp, user_query):
    if "revenue" in str(user_query).lower():
        revmean=df.groupby("COMPANY")["TOT_REV_MIL"].mean().sort_values(ascending=False)[comp]
        print(f" Mean revenue for {comp} is {revmean}")
    elif "liability" in str(user_query).lower():
        lialmean= df.groupby("COMPANY")["TOT_LIAL_MIL"].mean().sort_values(ascending=False)[comp]
        print(f" Mean revenue for {comp} is {lialmean}")

    elif "income" in str(user_query).lower():
        incmean= df.groupby("COMPANY")["NET_INC_MIL"].mean().sort_values(ascending=False)[comp]
        print(f" Mean revenue for {comp} is {incmean}")
    elif "asset" in str(user_query).lower():
        assmean= df.groupby("COMPANY")["TOT_ASS_MIL"].mean().sort_values(ascending=False)[comp]
        print(f" Mean revenue for {comp} is {assmean}")
    elif "cash flow" in str(user_query).lower():
        cashmean= df.groupby("COMPANY")["CASH_FLOW_MIL"].mean().sort_values(ascending=False)[comp]
        print(f" Mean revenue for {comp} is {cashmean}")

    else:
        print("I do not know the answer. Please ask something else.")

In [49]:
quit_words={"quit", "exit","good bye","bye"}

In [62]:
def general_queries(user_query):
    for wrd in quit_words:
        if wrd in str(user_query):
            break
    else:
        print("Good day.  Kindly ask me something specific.  Thank you.")

In [79]:
def comp_yrly(comp,yr, user_query):
     print(f"The year you have chosen is {yr} and the company you have chosen is {comp}")
     if "revenue growth" in str(user_query).lower():
        revyr= df[(df["COMPANY"]==comp) & (df["YEAR"]==int(yr))]["REV_GROWTH%"]
        print(f" revenue for {comp} is {revyr}")
     elif "income growth" in str(user_query).lower():
        incgrowth= df[(df["COMPANY"]==comp) & (df["YEAR"]==int(yr))]["INC_GROWTH%"]
        print(f" income growth for {comp} is {incgrowth}")
     elif "revenue" in str(user_query).lower():
        revgrowth= df[(df["COMPANY"]==comp) & (df["YEAR"]==int(yr))]["TOT_REV_MIL"]
        print(f" income growth for {comp} is {revgrowth}")
     elif "liability" in str(user_query).lower():
         lialyr=df[(df["COMPANY"]==comp) & (df["YEAR"]==int(yr))]["TOT_LIAL_MIL"]
         print(f" LIABILITY for {comp} is {lialyr}")
     elif "income" in str(user_query).lower():
        incyr= df[(df["COMPANY"]==comp) & (df["YEAR"]==int(yr))]["NET_INC_MIL"]
        print(f" INCOME for {comp} is {incyr}")
     elif "asset" in str(user_query).lower():
        assyr= df[(df["COMPANY"]==comp) & (df["YEAR"]==int(yr))]["TOT_ASS_MIL"]
        print(f" ASSET for {comp} is {assyr}")
     elif "cash flow" in str(user_query).lower():
        cashyr= df[(df["COMPANY"]==comp) & (df["YEAR"]==int(yr))]["CASH_FLOW_MIL"]
        print(f" CASH FLOW for {comp} is {cashyr}")
  
     else:
        print("I do not know the answer. Please ask something else.")

In [ ]:
def bot_prompt_loop():
    """
    Continuously prompts the user for input.
    """
    print("Welcome to the financial chatbot")
    print("Type 'exit' (or 'EXIT', 'Exit', etc.) to quit at any time.")

    while True:
        # Get user input
        user_query = input("Ask your question: ")

        # Check if the standardized input matches the exit command
        if user_query.lower() == 'exit':
            print("Exiting bot. Goodbye!")
            break
        
        # If the user input is not 'exit', process or display it
        if user_query:
            print(f"You entered: {user_query}")
            fetch_answers(user_query)
        else:
            print("Input cannot be empty. Please enter a string or 'exit'.")

if __name__ == '__main__':
    bot_prompt_loop()

Welcome to the financial chatbot
Type 'exit' (or 'EXIT', 'Exit', etc.) to quit at any time.

Ask your question:  apple 2022 revenue

You entered: apple 2022 revenue
The year you have chosen is 2022 and the company you have chosen is APPLE
 income growth for APPLE is 8    394328.0
Name: TOT_REV_MIL, dtype: float64
 Mean revenue for APPLE is 389549.3333333333
Good day.  Kindly ask me something specific.  Thank you.

Ask your question:  tesla 2023 income

You entered: tesla 2023 income
The year you have chosen is 2023 and the company you have chosen is TESLA
 INCOME for TESLA is 11    14997.0
Name: NET_INC_MIL, dtype: float64
 Mean revenue for TESLA is 11548.0
Good day.  Kindly ask me something specific.  Thank you.

Ask your question:  microsoft 2023 income growth

You entered: microsoft 2023 income growth
The year you have chosen is 2023 and the company you have chosen is MICROSOFT
 income growth for MICROSOFT is 3   -17.898475
Name: INC_GROWTH%, dtype: float64
 Mean revenue for MICROSOFT is 83766.75
Good day.  Kindly ask me something specific.  Thank you.